In [1]:
import pandas as pd
import numpy as np

In [17]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [18]:
for i in np.arange(1,df.From_To.count()):
  if pd.isnull(df.FlightNumber.loc[i,]):
    df.loc[i,'FlightNumber'] = df.FlightNumber.loc[i-1,] + 10

df['FlightNumber']=df['FlightNumber'].astype(int) 
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [19]:
temp_df = df.copy()
temp_df[['From','To']] = temp_df.From_To.str.split("_",expand=True)
temp_df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris         10045  ...    LoNDon      paris
1      MAdrid_miLAN         10055  ...    MAdrid      miLAN
2  londON_StockhOlm         10065  ...    londON  StockhOlm
3    Budapest_PaRis         10075  ...  Budapest      PaRis
4   Brussels_londOn         10085  ...  Brussels     londOn

[5 rows x 6 columns]

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [24]:
temp_df.From_To = temp_df.From_To.str.capitalize()
temp_df['From'] = temp_df['From'].str.capitalize()
temp_df['To'] = temp_df['To'].str.capitalize()
temp_df

            From_To  FlightNumber  ...      From         To
0      London_paris         10045  ...    London      Paris
1      Madrid_milan         10055  ...    Madrid      Milan
2  London_stockholm         10065  ...    London  Stockholm
3    Budapest_paris         10075  ...  Budapest      Paris
4   Brussels_london         10085  ...  Brussels     London

[5 rows x 6 columns]

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [25]:
df['From_To'] = temp_df['From_To']
df

            From_To  FlightNumber  RecentDelays              Airline
0      London_paris         10045      [23, 47]               KLM(!)
1      Madrid_milan         10055            []    <Air France> (12)
2  London_stockholm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_paris         10075          [13]       12. Air France
4   Brussels_london         10085      [67, 32]          "Swiss Air"

5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [26]:
row_values = []
_ = df.apply(lambda row:[row_values.append([row['From_To'], row['FlightNumber'],nn,row['Airline']]) for nn in row.RecentDelays], axis=1)  
row_values

[['London_paris', 10045, 23, 'KLM(!)'],
 ['London_paris', 10045, 47, 'KLM(!)'],
 ['London_stockholm', 10065, 24, '(British Airways. )'],
 ['London_stockholm', 10065, 43, '(British Airways. )'],
 ['London_stockholm', 10065, 87, '(British Airways. )'],
 ['Budapest_paris', 10075, 13, '12. Air France'],
 ['Brussels_london', 10085, 67, '"Swiss Air"'],
 ['Brussels_london', 10085, 32, '"Swiss Air"']]

In [27]:
new_df = pd.DataFrame(row_values, columns=df.columns)
new_df

            From_To  FlightNumber  RecentDelays              Airline
0      London_paris         10045            23               KLM(!)
1      London_paris         10045            47               KLM(!)
2  London_stockholm         10065            24  (British Airways. )
3  London_stockholm         10065            43  (British Airways. )
4  London_stockholm         10065            87  (British Airways. )
5    Budapest_paris         10075            13       12. Air France
6   Brussels_london         10085            67          "Swiss Air"
7   Brussels_london         10085            32          "Swiss Air"

In [28]:
df_recentdelays = pd.DataFrame(df['RecentDelays'].values.tolist())
df_recentdelays

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [29]:
df_recentdelays.shape

(5, 3)

In [30]:
length_columns = df_recentdelays.shape[1]
length_columns

3

In [31]:
df_recentdelays.columns[1]

1

In [33]:
columns_dict ={}
for i in range(length_columns):
 Key = df_recentdelays.columns[i]
 #print(key,i)
 Value = "Delay" + str(i+1)
 columns_dict[Key] = Value
columns_dict

{0: 'Delay1', 1: 'Delay2', 2: 'Delay3'}

In [34]:
df_recentdelays.rename(columns=columns_dict,inplace=True)
df_recentdelays

   Delay1  Delay2  Delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [36]:
new_df[["Delay1","Delay2","Delay3"]] = df_recentdelays[["Delay1","Delay2","Delay3"]]
new_df

            From_To  FlightNumber  RecentDelays  ... Delay1  Delay2  Delay3
0      London_paris         10045            23  ...   23.0    47.0     NaN
1      London_paris         10045            47  ...    NaN     NaN     NaN
2  London_stockholm         10065            24  ...   24.0    43.0    87.0
3  London_stockholm         10065            43  ...   13.0     NaN     NaN
4  London_stockholm         10065            87  ...   67.0    32.0     NaN
5    Budapest_paris         10075            13  ...    NaN     NaN     NaN
6   Brussels_london         10085            67  ...    NaN     NaN     NaN
7   Brussels_london         10085            32  ...    NaN     NaN     NaN

[8 rows x 7 columns]